import os
from make_mp3.convert_to_mp3 import convert_to_mp3, convert_to_mp3_2

law_objs = [
  {
    "law_title": "教育基本法",
    "law_id": "418AC0000000120",
    "article_numbers": [
      [1], [2], [3], [4], 
      [5], [6], [7], [8], 
      [9], [10], [11], [12], 
      [13], [14], [15], [16], 
      [17], [18]
    ],
    "texts": []
  },
  {
    "law_title": "学校教育法",
    "law_id": "322AC0000000026",
    "article_numbers": [
      [1], 
      [7], [8], 
      [11],
      [50], [51], 
      [56], [57], 
      [60],
    ],
    "texts": []
  },
  {
    "law_title": "地方公務員法",
    "law_id": "325AC0000000261",
    "article_numbers": [
      [1], [2],
      [30], [31], [32], [33],
      [34], [35], [36], [37],
      [38],
    ],
    "texts": []
  },
  {
    "law_title": "教育公務員特例法",
    "law_id": "324AC0000000001",
    "article_numbers": [
      [1],
      [11], [12],
      [17], [18],
      [21], [22], [22,5]
    ],
    "texts": []
  },
]

text_objs = [
  {
    "title":"高等学校 学習指導要領 第１章 総則 第１款 高等学校教育の基本と教育課程の役割",
    "texts":[
      "１ 各学校においては，教育基本法及び学校教育法その他の法令並びにこの章以下に示すところに従い，生"
      "徒の人間として調和のとれた育成を目指し，生徒の心身の発達の段階や特性等，課程や学科の特色及び学"
      "校や地域の実態を十分考慮して，適切な教育課程を編成するものとし，これらに掲げる目標を達成するよ"
      "う教育を行うものとする。",
      "２ 学校の教育活動を進めるに当たっては，各学校において，第３款の１に示す主体的・対話的で深い学び"
      "の実現に向けた授業改善を通して，創意工夫を生かした特色ある教育活動を展開する中で，次の（1）から"
      "（3）までに掲げる事項の実現を図り，生徒に生きる力を育むことを目指すものとする。",
      "（1）基礎的・基本的な知識及び技能を確実に習得させ，これらを活用して課題を解決するために必要な思"
      "考力，判断力，表現力等を育むとともに，主体的に学習に取り組む態度を養い，個性を生かし多様な"
      "人々との協働を促す教育の充実に努めること。その際，生徒の発達の段階を考慮して，生徒の言語活動"
      "など，学習の基盤をつくる活動を充実するとともに，家庭との連携を図りながら，生徒の学習習慣が確"
      "立するよう配慮すること。",
      "（2）道徳教育や体験活動，多様な表現や鑑賞の活動等を通して，豊かな心や創造性の涵養を目指した教育"
      "の充実に努めること。",
      "学校における道徳教育は，人間としての在り方生き方に関する教育を学校の教育活動全体を通じて行"
      "うことによりその充実を図るものとし，各教科に属する科目（以下「各教科・科目」という。），総合的"
      "な探究の時間及び特別活動（以下「各教科・科目等」という。）のそれぞれの特質に応じて，適切な指導"
      "を行うこと。",
      "道徳教育は，教育基本法及び学校教育法に定められた教育の根本精神に基づき，生徒が自己探求と自"
      "己実現に努め国家・社会の一員としての自覚に基づき行為しうる発達の段階にあることを考慮し，人間"
      "としての在り方生き方を考え，主体的な判断の下に行動し，自立した人間として他者と共によりよく生"
      "きるための基盤となる道徳性を養うことを目標とすること。",
      "道徳教育を進めるに当たっては，人間尊重の精神と生命に対する畏敬の念を家庭，学校，その他社会"
      "における具体的な生活の中に生かし，豊かな心をもち，伝統と文化を尊重し，それらを育んできた我が"
      "国と郷土を愛し，個性豊かな文化の創造を図るとともに，平和で民主的な国家及び社会の形成者として，"
      "公共の精神を尊び，社会及び国家の発展に努め，他国を尊重し，国際社会の平和と発展や環境の保全に"
      "貢献し未来を拓く主体性のある日本人の育成に資することとなるよう特に留意すること。",
      "（3）学校における体育・健康に関する指導を，生徒の発達の段階を考慮して，学校の教育活動全体を通じ"
      "て適切に行うことにより，健康で安全な生活と豊かなスポーツライフの実現を目指した教育の充実に努"
      "めること。特に，学校における食育の推進並びに体力の向上に関する指導，安全に関する指導及び心身"
      "の健康の保持増進に関する指導については，保健体育科，家庭科及び特別活動の時間はもとより，各教"
      "科・科目及び総合的な探究の時間などにおいてもそれぞれの特質に応じて適切に行うよう努めること。"
      "また，それらの指導を通して，家庭や地域社会との連携を図りながら，日常生活において適切な体育・"
      "健康に関する活動の実践を促し，生涯を通じて健康・安全で活力ある生活を送るための基礎が培われる"
      "よう配慮すること。",
      "３ ２の（1）から（3）までに掲げる事項の実現を図り，豊かな創造性を備え持続可能な社会の創り手となるこ"
      "とが期待される生徒に，生きる力を育むことを目指すに当たっては，学校教育全体及び各教科・科目等の"
      "指導を通してどのような資質・能力の育成を目指すのかを明確にしながら，教育活動の充実を図るものと"
      "する。その際，生徒の発達の段階や特性等を踏まえつつ，次に掲げることが偏りなく実現できるようにす"
      "るものとする。",
      "（1）知識及び技能が習得されるようにすること。",
      "（2）思考力，判断力，表現力等を育成すること。",
      "（3）学びに向かう力，人間性等を涵養すること。",
      "４ 学校においては，地域や学校の実態等に応じて，就業やボランティアに関わる体験的な学習の指導を適"
      "切に行うようにし，勤労の尊さや創造することの喜びを体得させ，望ましい勤労観，職業観の育成や社会"
      "奉仕の精神の涵養に資するものとする。",
      "５ 各学校においては，生徒や学校，地域の実態を適切に把握し，教育の目的や目標の実現に必要な教育の"
      "内容等を教科等横断的な視点で組み立てていくこと，教育課程の実施状況を評価してその改善を図ってい"
      "くこと，教育課程の実施に必要な人的又は物的な体制を確保するとともにその改善を図っていくことなど"
      "を通して，教育課程に基づき組織的かつ計画的に各学校の教育活動の質の向上を図っていくこと（以下「カ"
      "リキュラム・マネジメント」という。）に努めるものとする。"
    ]
  },
  {
    "title":"高等学校 学習指導要領 第１章 総則 第３款 教育課程の実施と学習評価",
    "texts":[
      "１ 主体的・対話的で深い学びの実現に向けた授業改善",
      "各教科・科目等の指導に当たっては，次の事項に配慮するものとする。",
      "（1） 第１款の３の（1）から（3）までに示すことが偏りなく実現されるよう，単元や題材など内容や時間のま"
      "とまりを見通しながら，生徒の主体的・対話的で深い学びの実現に向けた授業改善を行うこと。"
      "特に，各教科・科目等において身に付けた知識及び技能を活用したり，思考力，判断力，表現力等や"
      "学びに向かう力，人間性等を発揮させたりして，学習の対象となる物事を捉え思考することにより，各"
      "教科・科目等の特質に応じた物事を捉える視点や考え方（以下「見方・考え方」という。）が鍛えられて"
      "いくことに留意し，生徒が各教科・科目等の特質に応じた見方・考え方を働かせながら，知識を相互に"
      "関連付けてより深く理解したり，情報を精査して考えを形成したり，問題を見いだして解決策を考えた"
      "り，思いや考えを基に創造したりすることに向かう過程を重視した学習の充実を図ること。"
      "（2） 第２款の２の（1）に示す言語能力の育成を図るため，各学校において必要な言語環境を整えるとともに，"
      "国語科を要としつつ各教科・科目等の特質に応じて，生徒の言語活動を充実すること。あわせて，（6）に"
      "示すとおり読書活動を充実すること。",
      "（3） 第２款の２の（1）に示す情報活用能力の育成を図るため，各学校において，コンピュータや情報通信"
      "ネットワークなどの情報手段を活用するために必要な環境を整え，これらを適切に活用した学習活動の"
      "充実を図ること。また，各種の統計資料や新聞，視聴覚教材や教育機器などの教材・教具の適切な活用"
      "を図ること。",
      "（4） 生徒が学習の見通しを立てたり学習したことを振り返ったりする活動を，計画的に取り入れるように"
      "工夫すること。",
      "（5） 生徒が生命の有限性や自然の大切さ，主体的に挑戦してみることや多様な他者と協働することの重要"
      "性などを実感しながら理解することができるよう，各教科・科目等の特質に応じた体験活動を重視し，"
      "家庭や地域社会と連携しつつ体系的・継続的に実施できるよう工夫すること。",
      "（6） 学校図書館を計画的に利用しその機能の活用を図り，生徒の主体的・対話的で深い学びの実現に向け"
      "た授業改善に生かすとともに，生徒の自主的，自発的な学習活動や読書活動を充実すること。また，地"
      "域の図書館や博物館，美術館，劇場，音楽堂等の施設の活用を積極的に図り，資料を活用した情報の収"
      "集や鑑賞等の学習活動を充実すること。",
      "２ 学習評価の充実",
      "学習評価の実施に当たっては，次の事項に配慮するものとする。",
      "（1） 生徒のよい点や進歩の状況などを積極的に評価し，学習したことの意義や価値を実感できるようにす"
      "ること。また，各教科・科目等の目標の実現に向けた学習状況を把握する観点から，単元や題材など内"
      "容や時間のまとまりを見通しながら評価の場面や方法を工夫して，学習の過程や成果を評価し，指導の"
      "改善や学習意欲の向上を図り，資質・能力の育成に生かすようにすること。",
      "（2） 創意工夫の中で学習評価の妥当性や信頼性が高められるよう，組織的かつ計画的な取組を推進すると"
      "ともに，学年や学校段階を越えて生徒の学習の成果が円滑に接続されるように工夫すること。"
    ]
  },
  {
    "title":"高等学校 学習指導要領 第１章 総則 第５款 生徒の発達の支援",
    "texts":[
      "１ 生徒の発達を支える指導の充実",
      "　教育課程の編成及び実施に当たっては，次の事項に配慮するものとする。",
      "（1） 学習や生活の基盤として，教師と生徒との信頼関係及び生徒相互のよりよい人間関係を育てるため，"
      "日頃からホームルーム経営の充実を図ること。また，主に集団の場面で必要な指導や援助を行うガイダ"
      "ンスと，個々の生徒の多様な実態を踏まえ，一人一人が抱える課題に個別に対応した指導を行うカウン"
      "セリングの双方により，生徒の発達を支援すること。",
      "（2）生徒が，自己の存在感を実感しながら，よりよい人間関係を形成し，有意義で充実した学校生活を送"
      "る中で，現在及び将来における自己実現を図っていくことができるよう，生徒理解を深め，学習指導と"
      "関連付けながら，生徒指導の充実を図ること。",
      "（3）生徒が，学ぶことと自己の将来とのつながりを見通しながら，社会的・職業的自立に向けて必要な基"
      "盤となる資質・能力を身に付けていくことができるよう，特別活動を要としつつ各教科・科目等の特質"
      "に応じて，キャリア教育の充実を図ること。その中で，生徒が自己の在り方生き方を考え主体的に進路"
      "を選択することができるよう，学校の教育活動全体を通じ，組織的かつ計画的な進路指導を行うこと。",
      "（4）学校の教育活動全体を通じて，個々の生徒の特性等の的確な把握に努め，その伸長を図ること。また，"
      "生徒が適切な各教科・科目や類型を選択し学校やホームルームでの生活によりよく適応するとともに，"
      "現在及び将来の生き方を考え行動する態度や能力を育成することができるようにすること。",
      "（5）生徒が，基礎的・基本的な知識及び技能の習得も含め，学習内容を確実に身に付けることができるよ"
      "う，生徒や学校の実態に応じ，個別学習やグループ別学習，繰り返し学習，学習内容の習熟の程度に応"
      "じた学習，生徒の興味・関心等に応じた課題学習，補充的な学習や発展的な学習などの学習活動を取り"
      "入れることや，教師間の協力による指導体制を確保することなど，指導方法や指導体制の工夫改善によ"
      "り，個に応じた指導の充実を図ること。その際，第３款の１の（3）に示す情報手段や教材・教具の活用を"
      "図ること。",
      "（6）学習の遅れがちな生徒などについては，各教科・科目等の選択，その内容の取扱いなどについて必要"
      "な配慮を行い，生徒の実態に応じ，例えば義務教育段階の学習内容の確実な定着を図るための指導を適"
      "宜取り入れるなど，指導内容や指導方法を工夫すること。",
      "２ 特別な配慮を必要とする生徒への指導",
      "（1）障害のある生徒などへの指導",
      "ア 障害のある生徒などについては，特別支援学校等の助言又は援助を活用しつつ，個々の生徒の障害"
      "の状態等に応じた指導内容や指導方法の工夫を組織的かつ計画的に行うものとする。",
      "イ 障害のある生徒に対して，学校教育法施行規則第 140 条の規定に基づき，特別の教育課程を編成し，"
      "障害に応じた特別の指導（以下「通級による指導」という。）を行う場合には，学校教育法施行規則第"
      "129 条の規定により定める現行の特別支援学校高等部学習指導要領第６章に示す自立活動の内容を参"
      "考とし，具体的な目標や内容を定め，指導を行うものとする。その際，通級による指導が効果的に行"
      "われるよう，各教科・科目等と通級による指導との関連を図るなど，教師間の連携に努めるものとする。",
      "なお，通級による指導における単位の修得の認定については，次のとおりとする。",
      "（ｱ）学校においては，生徒が学校の定める個別の指導計画に従って通級による指導を履修し，その成"
      "果が個別に設定された指導目標からみて満足できると認められる場合には，当該学校の単位を修得"
      "したことを認定しなければならない。",
      "（ｲ）学校においては，生徒が通級による指導を２以上の年次にわたって履修したときは，各年次ごと"
      "に当該学校の単位を修得したことを認定することを原則とする。ただし，年度途中から通級による"
      "指導を開始するなど，特定の年度における授業時数が，１単位として計算する標準の単位時間に満"
      "たない場合は，次年度以降に通級による指導の時間を設定し，２以上の年次にわたる授業時数を合"
      "算して単位の修得の認定を行うことができる。また，単位の修得の認定を学期の区分ごとに行うこ"
      "とができる。",
      "ウ 障害のある生徒などについては，家庭，地域及び医療や福祉，保健，労働等の業務を行う関係機関"
      "との連携を図り，長期的な視点で生徒への教育的支援を行うために，個別の教育支援計画を作成し活"
      "用することに努めるとともに，各教科・科目等の指導に当たって，個々の生徒の実態を的確に把握し，"
      "個別の指導計画を作成し活用することに努めるものとする。特に，通級による指導を受ける生徒につ"
      "いては，個々の生徒の障害の状態等の実態を的確に把握し，個別の教育支援計画や個別の指導計画を"
      "作成し，効果的に活用するものとする。",
      "（2） 海外から帰国した生徒などの学校生活への適応や，日本語の習得に困難のある生徒に対する日本語指導",
      "ア 海外から帰国した生徒などについては，学校生活への適応を図るとともに，外国における生活経験"
      "を生かすなどの適切な指導を行うものとする。",
      "イ 日本語の習得に困難のある生徒については，個々の生徒の実態に応じた指導内容や指導方法の工夫"
      "を組織的かつ計画的に行うものとする。",
      "ウ　日本語の修得に困難のある生徒に対して，学校教育法施行規則第 86 条の２の規定に基づき，特別"
      "の教育課程を編成し，日本語の能力に応じた特別の指導（以下「通級による日本語指導」という。）を"
      "行う場合には，教師間の連携に努め，指導についての計画を個別に作成することなどにより，効果的"
      "な指導に努めるものとする。",
      "なお，通級による日本語指導における単位の修得の認定については，次のとおりとする。",
      "（ｱ）学校においては，生徒が学校の定める個別の指導計画に従って通級による日本語指導を履修し，"
      "その成果が個別に設定された指導目標からみて満足できると認められる場合には，当該学校の単位"
      "を修得したことを認定しなければならない。",
      "（ｲ）学校においては，生徒が通級による日本語指導を２以上の年次にわたって履修したときは，各年"
      "次ごとに当該学校の単位を修得したことを認定することを原則とする。ただし，年度途中から通級"
      "による日本語指導を開始するなど，特定の年度における授業時数が，１単位として計算する標準の"
      "単位時間に満たない場合は，次年度以降に通級による日本語指導の時間を設定し，２以上の年次に"
      "わたる授業時数を合算して単位の修得の認定を行うことができる。また，単位の修得の認定を学期"
      "の区分ごとに行うことができる。",
      "（3）不登校生徒への配慮",
      "ア 不登校生徒については，保護者や関係機関と連携を図り，心理や福祉の専門家の助言又は援助を得"
      "ながら，社会的自立を目指す観点から，個々の生徒の実態に応じた情報の提供その他の必要な支援を"
      "行うものとする。",
      "イ 相当の期間高等学校を欠席し引き続き欠席すると認められる生徒等を対象として，文部科学大臣が"
      "認める特別の教育課程を編成する場合には，生徒の実態に配慮した教育課程を編成するとともに，個"
      "別学習やグループ別学習など指導方法や指導体制の工夫改善に努めるものとする",
    ]
  },
  {
    "title":"高等学校 学習指導要領 第4章 総合的な探究の時間 第2 各学校において定める目標及び内容",
    "texts":[
      "１　目標",
      "各学校においては，第１の目標を踏まえ，各学校の総合的な探究の時間の目標を定める。",
      "２　内容",
      "各学校においては，第１の目標を踏まえ，各学校の総合的な探究の時間の内容を定める。",
      "３　各学校において定める目標及び内容の取扱い",
      "各学校において定める目標及び内容の設定に当たっては，次の事項に配慮するものとする。",
      "（1）各学校において定める目標については，各学校における教育目標を踏まえ，総合的な探究の時間を"
      "通して育成を目指す資質・能力を示すこと。",
      "（2） 各学校において定める目標及び内容については，他教科等の目標及び内容との違いに留意しつつ，"
      "他教科等で育成を目指す資質・能力との関連を重視すること。",
      "（3） 各学校において定める目標及び内容については，地域や社会との関わりを重視すること。",
      "（4） 各学校において定める内容については，目標を実現するにふさわしい探究課題，探究課題の解決を"
      "通して育成を目指す具体的な資質・能力を示すこと。",
      "（5） 目標を実現するにふさわしい探究課題については，地域や学校の実態，生徒の特性等に応じて，例"
      "えば，国際理解，情報，環境，福祉・健康などの現代的な諸課題に対応する横断的・総合的な課題，"
      "地域や学校の特色に応じた課題，生徒の興味・関心に基づく課題，職業や自己の進路に関する課題な"
      "どを踏まえて設定すること。",
      "（6） 探究課題の解決を通して育成を目指す具体的な資質・能力については，次の事項に配慮すること。",
      "ア 知識及び技能については，他教科等及び総合的な探究の時間で習得する知識及び技能が相互に関"
      "連付けられ，社会の中で生きて働くものとして形成されるようにすること。",
      "イ 思考力，判断力，表現力等については，課題の設定，情報の収集，整理・分析，まとめ・表現な"
      "どの探究の過程において発揮され，未知の状況において活用できるものとして身に付けられるよう"
      "にすること。",
      "ウ 学びに向かう力，人間性等については，自分自身に関すること及び他者や社会との関わりに関す"
      "ることの両方の視点を踏まえること。",
      "（7） 目標を実現するにふさわしい探究課題及び探究課題の解決を通して育成を目指す具体的な資質・能"
      "力については，教科・科目等を越えた全ての学習の基盤となる資質・能力が育まれ，活用されるもの"
      "となるよう配慮すること。"
    ]
  },
  {
    "title":"高等学校 学習指導要領 第4章 総合的な探究の時間 第3 指導計画の作成と内容の取扱い",
    "texts":[
      "１ 指導計画の作成に当たっては，次の事項に配慮するものとする。",
      "（1） 年間や，単元など内容や時間のまとまりを見通して，その中で育む資質・能力の育成に向けて，生徒"
      "の主体的・対話的で深い学びの実現を図るようにすること。その際，生徒や学校，地域の実態等に応じ"
      "て，生徒が探究の見方・考え方を働かせ，教科・科目等の枠を超えた横断的・総合的な学習や生徒の興"
      "味・関心等に基づく学習を行うなど創意工夫を生かした教育活動の充実を図ること。",
      "（2） 全体計画及び年間指導計画の作成に当たっては，学校における全教育活動との関連の下に，目標及び"
      "内容，学習活動，指導方法や指導体制，学習の評価の計画などを示すこと。",
      "（3） 目標を実現するにふさわしい探究課題を設定するに当たっては，生徒の多様な課題に対する意識を生"
      "かすことができるよう配慮すること。",
      "（4） 他教科等及び総合的な探究の時間で身に付けた資質・能力を相互に関連付け，学習や生活において生"
      "かし，それらが総合的に働くようにすること。その際，言語能力，情報活用能力など全ての学習の基盤"
      "となる資質・能力を重視すること。",
      "（5） 他教科等の目標及び内容との違いに留意しつつ，第１の目標並びに第２の各学校において定める目標"
      "及び内容を踏まえた適切な学習活動を行うこと。",
      "（6） 各学校における総合的な探究の時間の名称については，各学校において適切に定めること。",
      "（7） 障害のある生徒などについては，学習活動を行う場合に生じる困難さに応じた指導内容や指導方法の"
      "工夫を計画的，組織的に行うこと。"
      "（8） 総合学科においては，総合的な探究の時間の学習活動として，原則として生徒が興味・関心，進路等"
      "に応じて設定した課題について知識や技能の深化，総合化を図る学習活動を含むこと。",
      "２ 内容の取扱いに当たっては，次の事項に配慮するものとする。",
      "（1） 第２の各学校において定める目標及び内容に基づき，生徒の学習状況に応じて教師が適切な指導を行"
      "うこと。",
      "（2）課題の設定においては，生徒が自分で課題を発見する過程を重視すること。"
      "（3）第２の３の（6）のウにおける両方の視点を踏まえた学習を行う際には，これらの視点を生徒が自覚し，"
      "内省的に捉えられるよう配慮すること。",
      "（4）探究の過程においては，他者と協働して課題を解決しようとする学習活動や，言語により分析し，ま"
      "とめたり表現したりするなどの学習活動が行われるようにすること。その際，例えば，比較する，分類"
      "する，関連付けるなどの考えるための技法が自在に活用されるようにすること。",
      "（5） 探究の過程においては，コンピュータや情報通信ネットワークなどを適切かつ効果的に活用して，情"
      "報を収集・整理・発信するなどの学習活動が行われるよう工夫すること。その際，情報や情報手段を主"
      "体的に選択し活用できるよう配慮すること。",
      "（6）自然体験や就業体験活動，ボランティア活動などの社会体験，ものづくり，生産活動などの体験活動，"
      "観察・実験・実習，調査・研究，発表や討論などの学習活動を積極的に取り入れること。",
      "（7）体験活動については，第１の目標並びに第２の各学校において定める目標及び内容を踏まえ，探究の"
      "過程に適切に位置付けること。",
      "（8）グループ学習や個人研究などの多様な学習形態，地域の人々の協力も得つつ，全教師が一体となって"
      "指導に当たるなどの指導体制について工夫を行うこと。",
      "（9）学校図書館の活用，他の学校との連携，公民館，図書館，博物館等の社会教育施設や社会教育関係団"
      "体等の各種団体との連携，地域の教材や学習環境の積極的な活用などの工夫を行うこと。",
      "（10） 職業や自己の進路に関する学習を行う際には，探究に取り組むことを通して，自己を理解し，将来"
      "の在り方生き方を考えるなどの学習活動が行われるようにすること。"
    ]
  },
  {
    "title":"高等学校 学習指導要領 第5章　特別活動　第2　各活動・学校行事の目標及び内容　〔ホームルーム活動〕",
    "texts":[
      "１ 目標",
      "ホームルームや学校での生活をよりよくするための課題を見いだし，解決するために話し合い，合意"
      "形成し，役割を分担して協力して実践したり，ホームルームでの話合いを生かして自己の課題の解決及"
      "び将来の生き方を描くために意思決定して実践したりすることに，自主的，実践的に取り組むことを通"
      "して，第１の目標に掲げる資質・能力を育成することを目指す。",
      "２ 内容",
      "１の資質・能力を育成するため，全ての学年において，次の各活動を通して，それぞれの活動の意義"
      "及び活動を行う上で必要となることについて理解し，主体的に考えて実践できるよう指導する。",
      "（1）ホームルームや学校における生活づくりへの参画",
      "ア  ホームルームや学校における生活上の諸問題の解決",
      "ホームルームや学校における生活を向上・充実させるための課題を見いだし，解決するために話"
      "し合い，合意形成を図り，実践すること。",
      "イ  ホームルーム内の組織づくりや役割の自覚",
      "ホームルーム生活の充実や向上のため，生徒が主体的に組織をつくり，役割を自覚しながら仕事"
      "を分担して，協力し合い実践すること。",
      "ウ  学校における多様な集団の生活の向上",
      "生徒会などホームルームの枠を超えた多様な集団における活動や学校行事を通して学校生活の向"
      "上を図るため，ホームルームとしての提案や取組を話し合って決めること。",
      "（2）日常の生活や学習への適応と自己の成長及び健康安全",
      "ア  自他の個性の理解と尊重，よりよい人間関係の形成",
      "自他の個性を理解して尊重し，互いのよさや可能性を発揮し，コミュニケーションを図りながら"
      "よりよい集団生活をつくること。",
      "イ  男女相互の理解と協力",
      "男女相互について理解するとともに，共に協力し尊重し合い，充実した生活づくりに参画すること。",
      "ウ 国際理解と国際交流の推進",
      "我が国と他国の文化や生活習慣などについて理解し，よりよい交流の在り方を考えるなど，共に"
      "尊重し合い，主体的に国際社会に生きる日本人としての在り方生き方を探求しようとすること。",
      "エ 青年期の悩みや課題とその解決",
      "心や体に関する正しい理解を基に，適切な行動をとり，悩みや不安に向き合い乗り越えようとす"
      "ること。",
      "オ 生命の尊重と心身ともに健康で安全な生活態度や規律ある習慣の確立",
      "節度ある健全な生活を送るなど現在及び生涯にわたって心身の健康を保持増進することや，事件"
      "や事故，災害等から身を守り安全に行動すること。",
      "（3）一人一人のキャリア形成と自己実現",
      "ア 学校生活と社会的・職業的自立の意義の理解",
      "現在及び将来の生活や学習と自己実現とのつながりを考えたり，社会的・職業的自立の意義を意"
      "識したりしながら，学習の見通しを立て，振り返ること。",
      "イ 主体的な学習態度の確立と学校図書館等の活用",
      "自主的に学習する場としての学校図書館等を活用し，自分にふさわしい学習方法や学習習慣を身"
      "に付けること。",
      "ウ 社会参画意識の醸成や勤労観・職業観の形成",
      "社会の一員としての自覚や責任をもち，社会生活を営む上で必要なマナーやルール，働くことや"
      "社会に貢献することについて考えて行動すること。",
      "エ 主体的な進路の選択決定と将来設計",
      "適性やキャリア形成などを踏まえた教科・科目を選択することなどについて，目標をもって，在"
      "り方生き方や進路に関する適切な情報を収集・整理し，自己の個性や興味・関心と照らして考える"
      "こと。"
      "３　内容の取扱い",
      "（1）内容の（1）の指導に当たっては，集団としての意見をまとめる話合い活動など中学校の積み重ねや"
      "経験を生かし，それらを発展させることができるよう工夫すること。",
      "（2）内容の（3）の指導に当たっては，学校，家庭及び地域における学習や生活の見通しを立て，学んだ"
      "ことを振り返りながら，新たな学習や生活への意欲につなげたり，将来の在り方生き方を考えたりす"
      "る活動を行うこと。その際，生徒が活動を記録し蓄積する教材等を活用すること。",
    ]
  },
  {
    "title":"生徒指導提要 第1章 生徒指導の基礎 1.1.1 生徒指導の定義と目的",
    "texts":[
      "(1) 生徒指導の定義",
      "学校教育の目的は、「人格の完成を目指し、平和で民主的な国家及び社会の形成者とし"
      "て必要な資質を備えた心身ともに健康な国民の育成」（教育基本法第１条）を期すること"
      "であり、また、「個人の価値を尊重して、その能力を伸ばし、創造性を培い、自主及び自"
      "律の精神を養う」（同法第２条第２号）ことが目標の一つとして掲げられています。この"
      "学校教育の目的や目標達成に寄与する生徒指導を定義すると、次のようになります。",
      "生徒指導の定義",
      "生徒指導とは、児童生徒が、社会の中で自分らしく生きることができる存在へと、"
      "自発的・主体的に成長や発達する過程を支える教育活動のことである。なお、生"
      "徒指導上の課題に対応するために、必要に応じて指導や援助を行う。",
      "生徒指導は、児童生徒が自身を個性的存在として認め、自己に内在しているよさや可能"
      "性に自ら気付き、引き出し、伸ばすと同時に、社会生活で必要となる社会的資質・能力を"
      "身に付けることを支える働き（機能）です。したがって、生徒指導は学校の教育目標を達"
      "成する上で重要な機能を果たすものであり、学習指導と並んで学校教育において重要な意"
      "義を持つものと言えます。",
      "(2) 生徒指導の目的",
      "生徒指導の目的は、教育課程の内外を問わず、学校が提供する全ての教育活動の中で児"
      "童生徒の人格が尊重され、個性の発見とよさや可能性の伸長を児童生徒自らが図りな"
      "がら、多様な社会的資質・能力を獲得し、自らの資質・能力を適切に行使して自己実現を"
      "果たすべく、自己の幸福と社会の発展を児童生徒自らが追求することを支えるところに求"
      "められます。",
      "生徒指導の目的",
      "生徒指導は、児童生徒一人一人の個性の発見とよさや可能性の伸長と社会的資質・"
      "能力の発達を支えると同時に、自己の幸福追求と社会に受け入れられる自己実現"
      "を支えることを目的とする。",
      "生徒指導において発達を支えるとは、児童生徒の心理面（自信・自己肯定感等）の発達"
      "のみならず、学習面（興味・関心・学習意欲等）、社会面（人間関係・集団適応等）、進路"
      "面（進路意識・将来展望等）、健康面（生活習慣・メンタルヘルス等）の発達を含む包括的"
      "なものです。",
      "また、生徒指導の目的を達成するためには、児童生徒一人一人が自己指導能力を身に付"
      "けることが重要です。児童生徒が、深い自己理解に基づき、「何をしたいのか」、「何をす"
      "るべきか」、主体的に問題や課題を発見し、自己の目標を選択・設定して、この目標の達"
      "成のため、自発的、自律的、かつ、他者の主体性を尊重しながら、自らの行動を決断し、"
      "実行する力、すなわち、「自己指導能力」を獲得することが目指されます。",
      "児童生徒は、学校生活における多様な他者との関わり合いや学び合いの経験を通して、"
      "学ぶこと、生きること、働くことなどの価値や課題を見いだしていきます。その過程にお"
      "いて、自らの生き方や人生の目標が徐々に明確になります。学校から学校への移行、学校"
      "から社会への移行においても、主体的な選択・決定を促す自己指導能力が重要です。"
    ]
  },
  {
    "title":"11_生徒指導提要 第1章 生徒指導の基礎 1．2 生徒指導の構造",
    
    "texts":[
      "２軸３類４層構造",
      "生徒指導は、児童生徒の課題への対応を時間軸や対象、課題性の高低という観点から類"
      "別することで、構造化することができます。生徒指導の分類を示すと、図 1 のようになり"
      "ます。",
      "(1) 生徒指導の２軸",
      "児童生徒の課題への対応の時間軸に着目すると、図 1 の右端のように２分されます。",
      "① 常態的・先行的（プロアクティブ）生徒指導",
      "日常の生徒指導を基盤とする発達支持的生徒指導（→ 1.2.2 発達支持的生徒指導）"
      "と組織的・計画的な課題未然防止教育（→ 1.2.3 課題予防的生徒指導：課題未然防"
      "止教育）は、積極的な先手型の常態的・先行的（プロアクティブ）生徒指導と言え"
      "ます。",
      "② 即応的・継続的（リアクティブ）生徒指導"
      "課題の予兆的段階や初期状態における指導・援助を行う課題早期発見対応（→"
      "1.2.4 課題予防的生徒指導：課題早期発見対応）と、深刻な課題への切れ目のない"
      "指導・援助を行う困難課題対応的生徒指導（→ 1.2.5 困難課題対応的生徒指導）は、"
      "事後対応型の即応的・継続的（リアクティブ）生徒指導と言えます。"
      "(2) 生徒指導の３類",
      "生徒指導の課題性（「高い」・「低い」）と課題への対応の種類から分類すると、図 1 のよ"
      "うに以下の 3 類になります。",
      "① 発達支持的生徒指導",
      "全ての児童生徒の発達を支えます。",
      "② 課題予防的生徒指導",
      "全ての児童生徒を対象とした課題の未然防止教育と、課題の前兆行動が見られる一"
      "部の児童生徒を対象とした課題の早期発見と対応を含みます。",
      "③ 困難課題対応的生徒指導",
      "深刻な課題を抱えている特定の児童生徒への指導・援助を行います。",
      "(3) 生徒指導の４層",
      "図 2 は、図 1 の２軸３類に加えて、生徒指導の対象となる児童生徒の範囲から、全ての"
      "児童生徒を対象とした第１層「発達支持的生徒指導」と第２層「課題予防的生徒指導：課"
      "題未然防止教育」、一部の児童生徒を対象とした第３層「課題予防的生徒指導：課題早期"
      "発見対応」、そして、特定の生徒を対象とした第 4 層「困難課題対応的生徒指導」の４層"
      "から成る生徒指導の重層的支援構造を示したものです。以下で、具体的に各層につい"
      "て説明します。"
    ]
  },
]

def main():
  dry_run = True
  dry_run = False

  artist = "教育法規"

  base_dir = os.path.join(os.path.dirname(__file__),"mp3_output", artist)
  os.makedirs(base_dir, exist_ok=True)

  album_count = 1
  album_count = convert_to_mp3(base_dir, artist, law_objs, album_count=album_count, dry_run=dry_run, normal_rate=280)
  album_count = convert_to_mp3_2(base_dir, artist, text_objs, album_count=album_count, dry_run=dry_run, normal_rate=240)

if __name__ == "__main__":
  main()
