import os
from make_mp3.convert_to_mp3 import convert_to_mp3_2

text_objs = [  {
    "title":"第一章総則 第１款　高等学校教育の基本と教育課程の役割",
    "texts":[
"""１ 各学校においては，教育基本法及び学校教育法その他の法令並びにこの章以下に示すところに従い，生徒の人間として調和のとれた育成を目指し，生徒の心身の発達の段階や特性等，課程や学科の特色及び学校や地域の実態を十分考慮して，適切な教育課程を編成するものとし，これらに掲げる目標を達成するよう教育を行うものとする。
""",
"""２ 学校の教育活動を進めるに当たっては，各学校において，第３款の１に示す主体的・対話的で深い学びの実現に向けた授業改善を通して，創意工夫を生かした特色ある教育活動を展開する中で，次の（1）から（3）までに掲げる事項の実現を図り，生徒に生きる力を育むことを目指すものとする。
""",
"""（1）基礎的・基本的な知識及び技能を確実に習得させ，これらを活用して課題を解決するために必要な思考力，判断力，表現力等を育むとともに，主体的に学習に取り組む態度を養い，個性を生かし多様な人々との協働を促す教育の充実に努めること。
その際，生徒の発達の段階を考慮して，生徒の言語活動など，学習の基盤をつくる活動を充実するとともに，家庭との連携を図りながら，生徒の学習習慣が確立するよう配慮すること。
""",
"""（2）道徳教育や体験活動，多様な表現や鑑賞の活動等を通して，豊かな心や創造性の涵かん養を目指した教育の充実に努めること。
　学校における道徳教育は，人間としての在り方生き方に関する教育を学校の教育活動全体を通じて行うことによりその充実を図るものとし，各教科に属する科目（以下「各教科・科目」という。），総合的な探究の時間及び特別活動（以下「各教科・科目等」という。）のそれぞれの特質に応じて，適切な指導を行うこと。
　道徳教育は，教育基本法及び学校教育法に定められた教育の根本精神に基づき，生徒が自己探求と自己実現に努め国家・社会の一員としての自覚に基づき行為しうる発達の段階にあることを考慮し，人間としての在り方生き方を考え，主体的な判断の下に行動し，自立した人間として他者と共によりよく生きるための基盤となる道徳性を養うことを目標とすること。
　道徳教育を進めるに当たっては，人間尊重の精神と生命に対する畏敬の念を家庭，学校，その他社会における具体的な生活の中に生かし，豊かな心をもち，伝統と文化を尊重し，それらを育んできた我が国と郷土を愛し，個性豊かな文化の創造を図るとともに，平和で民主的な国家及び社会の形成者として，公共の精神を尊び，社会及び国家の発展に努め，他国を尊重し，国際社会の平和と発展や環境の保全に貢献し未来を拓ひらく主体性のある日本人の育成に資することとなるよう特に留意すること。
""",
"""（3）学校における体育・健康に関する指導を，生徒の発達の段階を考慮して，学校の教育活動全体を通じて適切に行うことにより，健康で安全な生活と豊かなスポーツライフの実現を目指した教育の充実に努めること。
特に，学校における食育の推進並びに体力の向上に関する指導，安全に関する指導及び心身の健康の保持増進に関する指導については，保健体育科，家庭科及び特別活動の時間はもとより，各教科・科目及び総合的な探究の時間などにおいてもそれぞれの特質に応じて適切に行うよう努めること。
また，それらの指導を通して，家庭や地域社会との連携を図りながら，日常生活において適切な体育・健康に関する活動の実践を促し，生涯を通じて健康・安全で活力ある生活を送るための基礎が培われるよう配慮すること。
""",
"""３ ２の（1）から（3）までに掲げる事項の実現を図り，豊かな創造性を備え持続可能な社会の創り手となることが期待される生徒に，生きる力を育むことを目指すに当たっては，学校教育全体及び各教科・科目等の指導を通してどのような資質・能力の育成を目指すのかを明確にしながら，教育活動の充実を図るものとする。その際，生徒の発達の段階や特性等を踏まえつつ，次に掲げることが偏りなく実現できるようにするものとする。
（1）知識及び技能が習得されるようにすること。
（2）思考力，判断力，表現力等を育成すること。
（3）学びに向かう力，人間性等を涵かん養すること。
""",
"""４ 学校においては，地域や学校の実態等に応じて，就業やボランティアに関わる体験的な学習の指導を適切に行うようにし，勤労の尊さや創造することの喜びを体得させ，望ましい勤労観，職業観の育成や社会奉仕の精神のかん養に資するものとする。
""",
"""５ 各学校においては，生徒や学校，地域の実態を適切に把握し，教育の目的や目標の実現に必要な教育の内容等を教科等横断的な視点で組み立てていくこと，教育課程の実施状況を評価してその改善を図っていくこと，教育課程の実施に必要な人的又は物的な体制を確保するとともにその改善を図っていくことなどを通して，教育課程に基づき組織的かつ計画的に各学校の教育活動の質の向上を図っていくこと（以下「カリキュラム・マネジメント」という。）に努めるものとする。
""",
    ]
  },
  {
    "title":"第一章総則 第２款　教育課程の編成",
    "texts":[
"""１ 各学校の教育目標と教育課程の編成
教育課程の編成に当たっては，学校教育全体や各教科・科目等における指導を通して育成を目指す資質・能力を踏まえつつ，各学校の教育目標を明確にするとともに，教育課程の編成についての基本的な方針が家庭や地域とも共有されるよう努めるものとする。その際，第４章の第２の１に基づき定められる目標との関連を図るものとする。
""",
"""２ 教科等横断的な視点に立った資質・能力の育成
（1）各学校においては，生徒の発達の段階を考慮し，言語能力，情報活用能力（情報モラルを含む。），問題発見・解決能力等の学習の基盤となる資質・能力を育成していくことができるよう，各教科・科目等の特質を生かし，教科等横断的な視点から教育課程の編成を図るものとする。
（2）各学校においては，生徒や学校，地域の実態及び生徒の発達の段階を考慮し，豊かな人生の実現や災害等を乗り越えて次代の社会を形成することに向けた現代的な諸課題に対応して求められる資質・能力を，教科等横断的な視点で育成していくことができるよう，各学校の特色を生かした教育課程の編成を図るものとする。
"""
    ]
  },
  {
    "title":"第一章 総則 第３款　教育課程の実施と学習評価",
    "texts":[
"""１ 主体的・対話的で深い学びの実現に向けた授業改善
　各教科・科目等の指導に当たっては，次の事項に配慮するものとする。
""",
"""（1）第１款の３の（1）から（3）までに示すことが偏りなく実現されるよう，単元や題材など内容や時間のまとまりを見通しながら，生徒の主体的・対話的で深い学びの実現に向けた授業改善を行うこと。
　特に，各教科・科目等において身に付けた知識及び技能を活用したり，思考力，判断力，表現力等や学びに向かう力，人間性等を発揮させたりして，学習の対象となる物事を捉え思考することにより，各教科・科目等の特質に応じた物事を捉える視点や考え方（以下「見方・考え方」という。）が鍛えられていくことに留意し，生徒が各教科・科目等の特質に応じた見方・考え方を働かせながら，知識を相互に関連付けてより深く理解したり，情報を精査して考えを形成したり，問題を見いだして解決策を考えたり，思いや考えを基に創造したりすることに向かう過程を重視した学習の充実を図ること。
""",
"""（2）第２款の２の（1）に示す言語能力の育成を図るため，各学校において必要な言語環境を整えるとともに，国語科を要としつつ各教科・科目等の特質に応じて，生徒の言語活動を充実すること。あわせて，（6）に示すとおり読書活動を充実すること。
""",
"""（3）第２款の２の（1）に示す情報活用能力の育成を図るため，各学校において，コンピュータや情報通信ネットワークなどの情報手段を活用するために必要な環境を整え，これらを適切に活用した学習活動の充実を図ること。
また，各種の統計資料や新聞，視聴覚教材や教育機器などの教材・教具の適切な活用を図ること。
""",
"""（4）生徒が学習の見通しを立てたり学習したことを振り返ったりする活動を，計画的に取り入れるように工夫すること。
""",
"""（5）生徒が生命の有限性や自然の大切さ，主体的に挑戦してみることや多様な他者と協働することの重要性などを実感しながら理解することができるよう，各教科・科目等の特質に応じた体験活動を重視し，家庭や地域社会と連携しつつ体系的・継続的に実施できるよう工夫すること。
""",
"""（6）学校図書館を計画的に利用しその機能の活用を図り，生徒の主体的・対話的で深い学びの実現に向けた授業改善に生かすとともに，生徒の自主的，自発的な学習活動や読書活動を充実すること。
また，地域の図書館や博物館，美術館，劇場，音楽堂等の施設の活用を積極的に図り，資料を活用した情報の収集や鑑賞等の学習活動を充実すること。
""",
"""２ 学習評価の充実
　学習評価の実施に当たっては，次の事項に配慮するものとする。
""",
"""（1）生徒のよい点や進歩の状況などを積極的に評価し，学習したことの意義や価値を実感できるようにすること。
また，各教科・科目等の目標の実現に向けた学習状況を把握する観点から，単元や題材など内容や時間のまとまりを見通しながら評価の場面や方法を工夫して，学習の過程や成果を評価し，指導の改善や学習意欲の向上を図り，資質・能力の育成に生かすようにすること。
""",
"""（2）創意工夫の中で学習評価の妥当性や信頼性が高められるよう，組織的かつ計画的な取組を推進するとともに，学年や学校段階を越えて生徒の学習の成果が円滑に接続されるように工夫すること。
"""
    ]
  },
  {
    "title":"第２章 各学科に共通する各教科 第10節 情報 第１款 目標",
    "texts":[
"""　情報に関する科学的な見方・考え方を働かせ，情報技術を活用して問題の発見・解決を行う学習活動を通して，問題の発見・解決に向けて情報と情報技術を適切かつ効果的に活用し，情報社会に主体的に参画するための資質・能力を次のとおり育成することを目指す。
（1）情報と情報技術及びこれらを活用して問題を発見・解決する方法について理解を深め技能を習得するとともに，情報社会と人との関わりについての理解を深めるようにする。
（2）様々な事象を情報とその結び付きとして捉え，問題の発見・解決に向けて情報と情報技術を適切かつ効果的に活用する力を養う。
（3）情報と情報技術を適切に活用するとともに，情報社会に主体的に参画する態度を養う。
"""
    ]
  },
  {
    "title":"第２章 各学科に共通する各教科 第10節 情報 第２款 各科目 第１ 情報Ⅰ １ 目標",
    "texts":[
"""情報に関する科学的な見方・考え方を働かせ，情報技術を活用して問題の発見・解決を行う学習活動を通して，問題の発見・解決に向けて情報と情報技術を適切かつ効果的に活用し，情報社会に主体的に参画するための資質・能力を次のとおり育成することを目指す。
""",
"""（1）効果的なコミュニケーションの実現，コンピュータやデータの活用について理解を深め技能を習得するとともに，情報社会と人との関わりについて理解を深めるようにする。
""",
"""（2）様々な事象を情報とその結び付きとして捉え，問題の発見・解決に向けて情報と情報技術を適切かつ効果的に活用する力を養う。
""",
"""（3）情報と情報技術を適切に活用するとともに，情報社会に主体的に参画する態度を養う。
"""
    ]
  },
  {
    "title":"第２章 各学科に共通する各教科 第10節 情報 第２款 各科目 第１ 情報Ⅰ ２ 内容",
    "texts":[
"""（1）情報社会の問題解決
　情報と情報技術を活用した問題の発見・解決の方法に着目し，情報社会の問題を発見・解決する活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""ア 次のような知識及び技能を身に付けること。
（ｱ）情報やメディアの特性を踏まえ，情報と情報技術を活用して問題を発見・解決する方法を身に付けること。
（ｲ）情報に関する法規や制度，情報セキュリティの重要性，情報社会における個人の責任及び情報モラルについて理解すること。
（ｳ）情報技術が人や社会に果たす役割と及ぼす影響について理解すること。
""",
"""イ 次のような思考力，判断力，表現力等を身に付けること。
（ｱ）目的や状況に応じて，情報と情報技術を適切かつ効果的に活用して問題を発見・解決する方法について考えること。
（ｲ）情報に関する法規や制度及びマナーの意義，情報社会において個人の果たす役割や責任，情報モラルなどについて，それらの背景を科学的に捉え，考察すること。
（ｳ）情報と情報技術の適切かつ効果的な活用と望ましい情報社会の構築について考察すること。
""",
"""（2）コミュニケーションと情報デザイン
　メディアとコミュニケーション手段及び情報デザインに着目し，目的や状況に応じて受け手に分かりやすく情報を伝える活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""ア 次のような知識及び技能を身に付けること。
（ｱ）メディアの特性とコミュニケーション手段の特徴について，その変遷も踏まえて科学的に理解すること。
（ｲ）情報デザインが人や社会に果たしている役割を理解すること。
（ｳ）効果的なコミュニケーションを行うための情報デザインの考え方や方法を理解し表現する技能を身に付けること。
""",
"""イ 次のような思考力，判断力，表現力等を身に付けること。
（ｱ）メディアとコミュニケーション手段の関係を科学的に捉え，それらを目的や状況に応じて適切に選択すること。
（ｲ）コミュニケーションの目的を明確にして，適切かつ効果的な情報デザインを考えること。
（ｳ）効果的なコミュニケーションを行うための情報デザインの考え方や方法に基づいて表現し，評価し改善すること。
""",
"""（3）コンピュータとプログラミング
　コンピュータで情報が処理される仕組みに着目し，プログラミングやシミュレーションによって問題を発見・解決する活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""ア 次のような知識及び技能を身に付けること。
（ｱ）コンピュータや外部装置の仕組みや特徴，コンピュータでの情報の内部表現と計算に関する限界について理解すること。
（ｲ）アルゴリズムを表現する手段，プログラミングによってコンピュータや情報通信ネットワークを活用する方法について理解し技能を身に付けること。
（ｳ）社会や自然などにおける事象をモデル化する方法，シミュレーションを通してモデルを評価し改善する方法について理解すること。
""",
"""イ 次のような思考力，判断力，表現力等を身に付けること。
（ｱ）コンピュータで扱われる情報の特徴とコンピュータの能力との関係について考察すること。
（ｲ）目的に応じたアルゴリズムを考え適切な方法で表現し，プログラミングによりコンピュータや情報通信ネットワークを活用するとともに，その過程を評価し改善すること。
（ｳ）目的に応じたモデル化やシミュレーションを適切に行うとともに，その結果を踏まえて問題の適切な解決方法を考えること。
""",
"""（4）情報通信ネットワークとデータの活用
　情報通信ネットワークを介して流通するデータに着目し，情報通信ネットワークや情報システムにより提供されるサービスを活用し，問題を発見・解決する活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""ア 次のような知識及び技能を身に付けること。
（ｱ）情報通信ネットワークの仕組みや構成要素，プロトコルの役割及び情報セキュリティを確保するための方法や技術について理解すること。
（ｲ）データを蓄積，管理，提供する方法，情報通信ネットワークを介して情報システムがサービスを提供する仕組みと特徴について理解すること。
（ｳ）データを表現，蓄積するための表し方と，データを収集，整理，分析する方法について理解し技能を身に付けること。
""",
"""イ 次のような思考力，判断力，表現力等を身に付けること。
（ｱ）目的や状況に応じて，情報通信ネットワークにおける必要な構成要素を選択するとともに，情報セキュリティを確保する方法について考えること。
（ｲ）情報システムが提供するサービスの効果的な活用について考えること。
（ｳ）データの収集，整理，分析及び結果の表現の方法を適切に選択し，実行し，評価し改善すること。
"""
    ]
  },
  {
    "title":"第２章 各学科に共通する各教科 第10節 情報 第２款 各科目 第１ 情報Ⅰ ３ 内容の取扱い",
    "texts":[
"""（1）内容の（1）から（4）までについては，中学校までの情報と情報技術及び情報社会に関する学習，問題の発見・解決に関する学習並びにデータの活用に関する学習などとの関連に配慮するものとする。
""",
"""（2）内容の（1）については，この科目の導入として位置付け，（2）から（4）までとの関連に配慮するものとする。
アの（ｲ）及び（ｳ）並びにイの（ｲ）及び（ｳ）については，生徒が情報社会の問題を主体的に発見し明確化し，解決策を考える活動を取り入れるものとする。
""",
"""（3）内容の（2）のアの（ｲ）については，身近で具体的な情報デザインの例を基に，コンピュータなどを簡単に操作できるようにする工夫，年齢や障害の有無，言語などに関係なく全ての人にとって利用しやすくする工夫などを取り上げるものとする。
""",
"""（4）内容の（3）のアの（ｲ）及びイの（ｲ）については，関数の定義・使用によりプログラムの構造を整理するとともに，性能を改善する工夫の必要性についても触れるものとする。
アの（ｳ）及びイの（ｳ）については，コンピュータを使う場合と使わない場合の双方を体験させるとともに，モデルの違いによって結果に違いが出ることについても触れるものとする。
""",
"""（5）内容の（4）のアの（ｱ）及びイの（ｱ）については，小規模なネットワークを設計する活動を取り入れるものとする。
アの（ｲ）及びイの（ｲ）については，自らの情報活用の評価・改善について発表し討議するなどの活動を取り入れるものとする。
アの（ｳ）及びイの（ｳ）については，比較，関連，変化，分類などの目的に応じた分析方法があることも扱うものとする。
""",
    ]
  },
  {
    "title":"第２章 各学科に共通する各教科 第10節 情報 第２款 各科目 第１ 情報Ⅰ 内容/内容の取扱い",
    "texts":[
"""（1）内容の（1）から（4）までについては，中学校までの情報と情報技術及び情報社会に関する学習，問題の発見・解決に関する学習並びにデータの活用に関する学習などとの関連に配慮するものとする。
""",
"""（1）情報社会の問題解決
この科目の導入として位置付け，（2）から（4）までとの関連に配慮するものとする。
情報と情報技術を活用した問題の発見・解決の方法に着目し，情報社会の問題を発見・解決する活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""（ｱ）次のような知識及び技能を身に付けること。
情報やメディアの特性を踏まえ，情報と情報技術を活用して問題を発見・解決する方法を身に付けること。
次のような思考力，判断力，表現力等を身に付けること。
目的や状況に応じて，情報と情報技術を適切かつ効果的に活用して問題を発見・解決する方法について考えること。
""",
"""（ｲ）生徒が情報社会の問題を主体的に発見し明確化し，解決策を考える活動を取り入れるものとする。
次のような知識及び技能を身に付けること。
情報に関する法規や制度，情報セキュリティの重要性，情報社会における個人の責任及び情報モラルについて理解すること。
次のような思考力，判断力，表現力等を身に付けること。
情報に関する法規や制度及びマナーの意義，情報社会において個人の果たす役割や責任，情報モラルなどについて，それらの背景を科学的に捉え，考察すること。
""",
"""（ｳ）生徒が情報社会の問題を主体的に発見し明確化し，解決策を考える活動を取り入れるものとする。
次のような知識及び技能を身に付けること。
情報技術が人や社会に果たす役割と及ぼす影響について理解すること。
次のような思考力，判断力，表現力等を身に付けること。
情報と情報技術の適切かつ効果的な活用と望ましい情報社会の構築について考察すること。
""",
"""（2）コミュニケーションと情報デザイン
　メディアとコミュニケーション手段及び情報デザインに着目し，目的や状況に応じて受け手に分かりやすく情報を伝える活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""（ｱ）次のような知識及び技能を身に付けること。
メディアの特性とコミュニケーション手段の特徴について，その変遷も踏まえて科学的に理解すること。
次のような思考力，判断力，表現力等を身に付けること。
メディアとコミュニケーション手段の関係を科学的に捉え，それらを目的や状況に応じて適切に選択すること。
""",
"""（ｲ）次のような知識及び技能を身に付けること。
情報デザインが人や社会に果たしている役割を理解すること。
身近で具体的な情報デザインの例を基に，コンピュータなどを簡単に操作できるようにする工夫，年齢や障害の有無，言語などに関係なく全ての人にとって利用しやすくする工夫などを取り上げるものとする。
次のような思考力，判断力，表現力等を身に付けること。
コミュニケーションの目的を明確にして，適切かつ効果的な情報デザインを考えること。
""",
"""（ｳ）次のような知識及び技能を身に付けること。
効果的なコミュニケーションを行うための情報デザインの考え方や方法を理解し表現する技能を身に付けること。
次のような思考力，判断力，表現力等を身に付けること。
効果的なコミュニケーションを行うための情報デザインの考え方や方法に基づいて表現し，評価し改善すること。
""",
"""（3）コンピュータとプログラミング
　コンピュータで情報が処理される仕組みに着目し，プログラミングやシミュレーションによって問題を発見・解決する活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""（ｱ）次のような知識及び技能を身に付けること。
コンピュータや外部装置の仕組みや特徴，コンピュータでの情報の内部表現と計算に関する限界について理解すること。
次のような思考力，判断力，表現力等を身に付けること。
コンピュータで扱われる情報の特徴とコンピュータの能力との関係について考察すること。
""",
"""（ｲ）関数の定義・使用によりプログラムの構造を整理するとともに，性能を改善する工夫の必要性についても触れるものとする。
次のような知識及び技能を身に付けること。
アルゴリズムを表現する手段，プログラミングによってコンピュータや情報通信ネットワークを活用する方法について理解し技能を身に付けること。
次のような思考力，判断力，表現力等を身に付けること。
目的に応じたアルゴリズムを考え適切な方法で表現し，プログラミングによりコンピュータや情報通信ネットワークを活用するとともに，その過程を評価し改善すること。
""",
"""（ｳ）コンピュータを使う場合と使わない場合の双方を体験させるとともに，モデルの違いによって結果に違いが出ることについても触れるものとする。
次のような知識及び技能を身に付けること。
社会や自然などにおける事象をモデル化する方法，シミュレーションを通してモデルを評価し改善する方法について理解すること。
次のような思考力，判断力，表現力等を身に付けること。
目的に応じたモデル化やシミュレーションを適切に行うとともに，その結果を踏まえて問題の適切な解決方法を考えること。
""",
"""（4）情報通信ネットワークとデータの活用
　情報通信ネットワークを介して流通するデータに着目し，情報通信ネットワークや情報システムにより提供されるサービスを活用し，問題を発見・解決する活動を通して，次の事項を身に付けることができるよう指導する。
""",
"""（ｱ）小規模なネットワークを設計する活動を取り入れるものとする。
次のような知識及び技能を身に付けること。
情報通信ネットワークの仕組みや構成要素，プロトコルの役割及び情報セキュリティを確保するための方法や技術について理解すること。
次のような思考力，判断力，表現力等を身に付けること。
目的や状況に応じて，情報通信ネットワークにおける必要な構成要素を選択するとともに，情報セキュリティを確保する方法について考えること。
""",
"""（ｲ）自らの情報活用の評価・改善について発表し討議するなどの活動を取り入れるものとする。
次のような知識及び技能を身に付けること。
データを蓄積，管理，提供する方法，情報通信ネットワークを介して情報システムがサービスを提供する仕組みと特徴について理解すること。
次のような思考力，判断力，表現力等を身に付けること。
情報システムが提供するサービスの効果的な活用について考えること。
""",
"""（ｳ）比較，関連，変化，分類などの目的に応じた分析方法があることも扱うものとする。
次のような知識及び技能を身に付けること。
データを表現，蓄積するための表し方と，データを収集，整理，分析する方法について理解し技能を身に付けること。
次のような思考力，判断力，表現力等を身に付けること。
データの収集，整理，分析及び結果の表現の方法を適切に選択し，実行し，評価し改善すること。
"""
    ]
  }
]

def main():
  dry_run = True
  dry_run = False

  artist = "学習指導要領"

  base_dir = os.path.join(os.path.dirname(__file__),"mp3_output", artist)
  os.makedirs(base_dir, exist_ok=True)

  album_count = 1
  album_count = convert_to_mp3_2(base_dir, artist, text_objs, album_count=album_count, dry_run=dry_run, normal_rate=240)

if __name__ == "__main__":
  main()
