import os
from make_mp3.convert_to_mp3 import convert_to_mp3

law_objs = [
  {
    "law_title": "電波法",
    "law_id": "325AC0000000131",
    "article_numbers": [
      [1], [2], [3], 
      [4], # 無線局の開設
      [10], # 落成後の検査
      [11], # 免許の拒否
      [13], # 免許の有効期間
      [14], # 免許記録
      [16], # 運用開始及び休止の届出
      [17], # 変更等の許可等
      [18], # 変更検査
      [19], # 申請による周波数等の変更
      [21], # 免許記録の変更等
      [22], [23], [24], # 無線局の廃止
      [28], # 電波の質
      [29], # 受信設備の条件
      [31], # 周波数測定装置の備えつけ
      [33],[34],[35],
      [37],
      [39], # 無線設備の操作
      [41],
      [42], # 免許を与えない場合
      [48,2],[48,3],
      [50],
      [52], [53], [54], [55], # 目的外使用の禁止等
      [56], # 混信等の防止
      [57], # 擬似空中線回路の使用
      [59], # 秘密の保護
      [60], # 時計、業務書類等の備付け
      [62],[63],
      [65],[66],[67],[68],
      [71], # 周波数等の変更
      [72], # 電波の発射の停止
      [73], # 検査
      [78], # 電波の発射の防止
      [79], # 無線従事者の免許の取消し等
      [80],[81], # 報告等
      [81,2]
    ],
    "texts": []
  },
  {
    "law_title": "電波法施行規則",
    "law_id": "325M50080000014",
    "article_numbers": [
      [2],[4,2], 
      [7],[8],[10,2],
      [11,3],[11,4],
      [12],[28],[28,4],[29],
      [34,2],[34,5],[34,6],[34,7],[34,11],
      [35,2],[36],[37],
      [38],[38,3],[38,4],
      [40],[42,4],[43,4]
    ],
    "texts": []
  },
  {
    "law_title": "無線局免許手続規則",
    "law_id": "325M50080000015",
    "article_numbers": [
      [18],[19],
    ],
    "texts": []
  },
  {
    "law_title": "無線設備規則",
    "law_id": "325M50080000018",
    "article_numbers": [
      [5],[6],[7],
      [24],
      [37,28],
      [41,4],
      [45,3,4],
      [48]
    ],
    "texts": []
  },
  {
    "law_title": "無線局運用規則",
    "law_id": "325M50080000017",
    "article_numbers": [
      [3],
      [5],[6],[7],[8],[8,2],
      [10], # 無線通信の原則
      [14], # 業務用語
      [16], # 送信速度等
      [18],
      [19, 2], # 発射前の措置
      [21], # 呼出しの反復及び再開
      [22], # 呼出しの中止
      [26], # 不確実な呼出しに対する応答
      [40, 2],
      [41],[44],[45],
      [55],[58],[58,4],[58,5],[58,6],[58,11],
      [70,2],[75],[75,2],[76],[77],[78],
      [81,3],[81,4],[81,5],[81,7],[81,8],
      [83],[85],[89],[91],[92],[93],[94,2],[96]
    ],
    "texts": []
  },
]

def main():
  dry_run = True
  dry_run = False

  artist = "1海通"

  base_dir = os.path.join(os.path.dirname(__file__),"mp3_output", artist)
  os.makedirs(base_dir, exist_ok=True)

  convert_to_mp3(base_dir, artist, law_objs, album_count=1, dry_run=dry_run, normal_rate=280)

if __name__ == "__main__":
  main()
