import os
from make_mp3.convert_to_mp3 import convert_to_mp3

law_objs = [
  {
    "law_title": "電波法",
    "law_id": "325AC0000000131",
    "article_numbers": [
      [1], [2], [3], 
      [4], # 無線局の開設
      [6], # 免許の申請
      [7], # 申請の審査
      [8], # 予備免許
      [9], # 工事設計等の変更
      [10], # 落成後の検査
      [11], # 免許の拒否
      [12], # 免許の付与
      [13], # 免許の有効期間
      [14], # 免許記録
      [14,2], # 証明書の交付
      [16], # 運用開始及び休止の届出
      [17], # 変更等の許可等
      [18], # 変更検査
      [19], # 申請による周波数等の変更
      [21], # 免許記録の変更等
      [22], [23], [24], # 無線局の廃止
      [28], # 電波の質
      [29], # 受信設備の条件
      [30], # 安全施設
      [31], # 周波数測定装置の備えつけ
      [39], # 無線設備の操作
      [39,13], # アマチュア無線局の無線設備の操作
      [42], # 免許を与えない場合
      [52], [53], [54], [55], # 目的外使用の禁止等
      [56], # 混信等の防止
      [57], # 擬似空中線回路の使用
      [58], # アマチュア無線局の通信
      [59], # 秘密の保護
      [60], # 時計、業務書類等の備付け
      [61], # 通信方法等
      [70, 7] # 非常時運用人による無線局の運用
      [71], # 周波数等の変更
      [71, 5], # 技術基準適合命令
      [72], # 電波の発射の停止
      [73], # 検査
      [74], # 非常の場合の無線通信
      [74, 2], # 非常の場合の通信体制の整備
      [75], [76], # 無線局の免許の取消し等
      [78], # 電波の発射の防止
      [79], # 無線従事者の免許の取消し等
      [80],[81], # 報告等
      [109], # 秘密の保護
    ],
    "texts": []
  },
  {
    "law_title": "無線局運用規則",
    "law_id": "325M50080000017",
    "article_numbers": [
      [2], # 定義
      [10], # 無線通信の原則
      [13], [14], # 業務用語
      [15], [16], # 送信速度等
      [19, 2], # 発射前の措置
      [20], # 呼出し
      [21], # 呼出しの反復及び再開
      [22], # 呼出しの中止
      [23], # 応答
      [24], # 通報の有無の通知
      [25], # 通報の連続送信
      [26], # 不確実な呼出しに対する応答
      [27], [28], # 電波の変更
      [29], # 通報の送信
      [30], # 長時間の送信
      [31], # 誤送の訂正
      [32], # 通報の反覆
      [34],[35], # 通信中の周波数の変更
      [36], # 送信の終了
      [37], # 受信証
      [38], # 通信の終了
      [39], # 試験電波の発射
      [257], [258], # 発射の制限等
      [258, 2], # 周波数等の使用区別
      [259], # 禁止する通報
      [260], # 無線設備の操作
    ],
    "texts": []
  },
  {
    "law_title": "電波法施行規則",
    "law_id": "325M50080000014",
    "article_numbers": [
      [5], 
    ],
    "texts": []
  }
]

def main():
  dry_run = True
  dry_run = False

  artist = "無線従事者"

  base_dir = os.path.join(os.path.dirname(__file__),"mp3_output", artist)
  os.makedirs(base_dir, exist_ok=True)

  convert_to_mp3(base_dir, artist, law_objs, album_count=1, dry_run=dry_run, normal_rate=280)

if __name__ == "__main__":
  main()
